; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v6 ?v2)
             (pred_6 ?v5 ?v13)
             (pred_11 ?v6 ?v13)
             (pred_12 ?v11 ?v6 )
	     (pred_2 ?v6)
             (pred_9 ?v3)
             (pred_7 ?v5)
             (pred_10 ?v13)
             (pred_3 ?v6)
             (pred_4 ?v5)
             (pred_5 ?v6)
             (pred_1 ))



(:action op_3
:parameters (?v8 ?v12 ?v7 ?v9)
:precondition (and (pred_9 ?v8) (pred_9 ?v12) (pred_7 ?v7) (pred_10 ?v9)
          (pred_8 ?v8 ?v12) (pred_6 ?v7 ?v9)
                   (pred_11 ?v12 ?v9) (pred_2 ?v8) 
                   (pred_3 ?v12) (pred_4 ?v7))
:effect (and  (pred_5 ?v12) (not (pred_3 ?v12))))


(:action op_4
:parameters (?v8 ?v4)
:precondition (and (pred_9 ?v8) (pred_9 ?v4)
               (pred_2 ?v8) (pred_8 ?v8 ?v4) (pred_5 ?v4))
:effect (and (pred_2 ?v4) (not (pred_2 ?v8))))

(:action op_5
:parameters (?v8 ?v7)
:precondition (and (pred_9 ?v8) (pred_7 ?v7) 
                  (pred_2 ?v8) (pred_12 ?v7 ?v8) (pred_1 ))
:effect (and (pred_4 ?v7)
   (not (pred_12 ?v7 ?v8)) (not (pred_1 ))))


(:action op_1
:parameters (?v8 ?v1 ?v10)
:precondition (and (pred_9 ?v8) (pred_7 ?v1) (pred_7 ?v10)
                  (pred_2 ?v8) (pred_4 ?v10) (pred_12 ?v1 ?v8))
:effect (and (pred_4 ?v1) (pred_12 ?v10 ?v8)
        (not (pred_4 ?v10)) (not (pred_12 ?v1 ?v8))))

(:action op_2
:parameters (?v8 ?v7)
:precondition (and (pred_9 ?v8) (pred_7 ?v7) 
                  (pred_2 ?v8) (pred_4 ?v7))
:effect (and (pred_1 ) (pred_12 ?v7 ?v8) (not (pred_4 ?v7)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_28 obj_29 obj_13 obj_22 obj_27 obj_01 obj_02 obj_19 obj_11 obj_16 obj_23 obj_14 obj_31 obj_04 obj_09 obj_12 obj_20 obj_05 obj_30 obj_21 obj_07 obj_15 obj_24 obj_25 obj_17
    obj_26 obj_08 obj_06
    obj_03 obj_18 obj_10
    )

    (:init
       (pred_1)

       (pred_9 obj_28)
       (pred_9 obj_29)
       (pred_9 obj_13)
       (pred_9 obj_22)
       (pred_9 obj_27)
       (pred_9 obj_01)
       (pred_9 obj_02)
       (pred_9 obj_19)
       (pred_9 obj_11)
       (pred_9 obj_16)
       (pred_9 obj_23)
       (pred_9 obj_14)
       (pred_9 obj_31)
       (pred_9 obj_04)
       (pred_9 obj_09)
       (pred_9 obj_12)
       (pred_9 obj_20)
       (pred_9 obj_05)
       (pred_9 obj_30)
       (pred_9 obj_21)
       (pred_9 obj_07)
       (pred_9 obj_15)
       (pred_9 obj_24)
       (pred_9 obj_25)
       (pred_9 obj_17)
       (pred_10 obj_26)
       (pred_10 obj_08)
       (pred_10 obj_06)
       (pred_7 obj_03)
       (pred_7 obj_18)
       (pred_7 obj_10)

       (pred_8 obj_28 obj_01)
       (pred_8 obj_28 obj_29)
       (pred_8 obj_29 obj_02)
       (pred_8 obj_29 obj_13)
       (pred_8 obj_29 obj_28)
       (pred_8 obj_13 obj_19)
       (pred_8 obj_13 obj_22)
       (pred_8 obj_13 obj_29)
       (pred_8 obj_22 obj_11)
       (pred_8 obj_22 obj_27)
       (pred_8 obj_22 obj_13)
       (pred_8 obj_27 obj_16)
       (pred_8 obj_27 obj_22)
       (pred_8 obj_01 obj_23)
       (pred_8 obj_01 obj_02)
       (pred_8 obj_01 obj_28)
       (pred_8 obj_02 obj_14)
       (pred_8 obj_02 obj_19)
       (pred_8 obj_02 obj_29)
       (pred_8 obj_02 obj_01)
       (pred_8 obj_19 obj_31)
       (pred_8 obj_19 obj_11)
       (pred_8 obj_19 obj_13)
       (pred_8 obj_19 obj_02)
       (pred_8 obj_11 obj_04)
       (pred_8 obj_11 obj_16)
       (pred_8 obj_11 obj_22)
       (pred_8 obj_11 obj_19)
       (pred_8 obj_16 obj_09)
       (pred_8 obj_16 obj_27)
       (pred_8 obj_16 obj_11)
       (pred_8 obj_23 obj_12)
       (pred_8 obj_23 obj_14)
       (pred_8 obj_23 obj_01)
       (pred_8 obj_14 obj_20)
       (pred_8 obj_14 obj_31)
       (pred_8 obj_14 obj_02)
       (pred_8 obj_14 obj_23)
       (pred_8 obj_31 obj_05)
       (pred_8 obj_31 obj_04)
       (pred_8 obj_31 obj_19)
       (pred_8 obj_31 obj_14)
       (pred_8 obj_04 obj_30)
       (pred_8 obj_04 obj_09)
       (pred_8 obj_04 obj_11)
       (pred_8 obj_04 obj_31)
       (pred_8 obj_09 obj_21)
       (pred_8 obj_09 obj_16)
       (pred_8 obj_09 obj_04)
       (pred_8 obj_12 obj_07)
       (pred_8 obj_12 obj_20)
       (pred_8 obj_12 obj_23)
       (pred_8 obj_20 obj_15)
       (pred_8 obj_20 obj_05)
       (pred_8 obj_20 obj_14)
       (pred_8 obj_20 obj_12)
       (pred_8 obj_05 obj_24)
       (pred_8 obj_05 obj_30)
       (pred_8 obj_05 obj_31)
       (pred_8 obj_05 obj_20)
       (pred_8 obj_30 obj_25)
       (pred_8 obj_30 obj_21)
       (pred_8 obj_30 obj_04)
       (pred_8 obj_30 obj_05)
       (pred_8 obj_21 obj_17)
       (pred_8 obj_21 obj_09)
       (pred_8 obj_21 obj_30)
       (pred_8 obj_07 obj_15)
       (pred_8 obj_07 obj_12)
       (pred_8 obj_15 obj_24)
       (pred_8 obj_15 obj_20)
       (pred_8 obj_15 obj_07)
       (pred_8 obj_24 obj_25)
       (pred_8 obj_24 obj_05)
       (pred_8 obj_24 obj_15)
       (pred_8 obj_25 obj_17)
       (pred_8 obj_25 obj_30)
       (pred_8 obj_25 obj_24)
       (pred_8 obj_17 obj_21)
       (pred_8 obj_17 obj_25)
       (pred_3 obj_25)
       (pred_3 obj_19)
       (pred_3 obj_15)
       (pred_11  obj_25 obj_26)
       (pred_11  obj_19 obj_08)
       (pred_11  obj_15 obj_06)
       (pred_5 obj_28)
       (pred_5 obj_29)
       (pred_5 obj_13)
       (pred_5 obj_22)
       (pred_5 obj_27)
       (pred_5 obj_01)
       (pred_5 obj_02)
       (pred_5 obj_11)
       (pred_5 obj_16)
       (pred_5 obj_23)
       (pred_5 obj_14)
       (pred_5 obj_31)
       (pred_5 obj_04)
       (pred_5 obj_09)
       (pred_5 obj_12)
       (pred_5 obj_20)
       (pred_5 obj_05)
       (pred_5 obj_30)
       (pred_5 obj_21)
       (pred_5 obj_07)
       (pred_5 obj_24)
       (pred_5 obj_17)

       (pred_6  obj_03 obj_26)
       (pred_6  obj_18 obj_08)
       (pred_6  obj_10 obj_06)
       (pred_12 obj_03 obj_20)
       (pred_12 obj_18 obj_30)
       (pred_12 obj_10 obj_27)
       (pred_2 obj_16)
    )

    (:goal (and
       (pred_12 obj_03 obj_04)
    ))
(:constraints
  (always (not (pred_2 obj_05)))
)
)

; plan
1. (op_4 obj_16 obj_11)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_11)
   goals met: 0 of 1
2. (op_4 obj_11 obj_04)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_04)
   goals met: 0 of 1
3. (op_4 obj_04 obj_30)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_30)
   goals met: 0 of 1
4. (op_5 obj_30 obj_18)
   deleted: (pred_12 obj_18 obj_30) (pred_1)
   added: (pred_4 obj_18)
   goals met: 0 of 1
5. (op_4 obj_30 obj_04)
   deleted: (pred_2 obj_30)
   added: (pred_2 obj_04)
   goals met: 0 of 1
6. (op_2 obj_04 obj_18)
   deleted: (pred_4 obj_18)
   added: (pred_1) (pred_12 obj_18 obj_04)
   goals met: 0 of 1
7. (op_4 obj_04 obj_31)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_31)
   goals met: 0 of 1
8. (op_4 obj_31 obj_14)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_14)
   goals met: 0 of 1
9. (op_4 obj_14 obj_20)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_20)
   goals met: 0 of 1
10. (op_5 obj_20 obj_03)
   deleted: (pred_12 obj_03 obj_20) (pred_1)
   added: (pred_4 obj_03)
   goals met: 0 of 1
11. (op_4 obj_20 obj_14)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_14)
   goals met: 0 of 1
12. (op_4 obj_14 obj_31)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_31)
   goals met: 0 of 1
13. (op_4 obj_31 obj_04)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_04)
   goals met: 0 of 1
14. (op_1 obj_04 obj_18 obj_03)
   deleted: (pred_4 obj_03) (pred_12 obj_18 obj_04)
   added: (pred_4 obj_18) (pred_12 obj_03 obj_04)
   goals met: 1 of 1
